app/controllers/blogs_controller.rb

SELECT  `blogs`.* FROM `blogs`  ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `blogs`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (NULL)
---
  def index
    @blogs = Blog.includes(:user).page(params[:page]).per(5).order("created_at DESC")

INSERT INTO `blogs` (`text`, `user_id`, `created_at`, `updated_at`) VALUES ('再々テスト投稿', 3, '2018-10-31 09:44:59', '2018-10-31 09:44:59')
---
  def create
    # binding.pry
    Blog.create(text: blog_params[:text], user_id: current_user.id)

SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 29 LIMIT 1
---
  def show
    @blog = Blog.find(params[:id])

SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 18 LIMIT 1
DELETE FROM `blogs` WHERE `blogs`.`id` = 18
---
  def destroy
    blog = Blog.find(params[:id])
    blog.destroy if blog.user_id == current_user.id

SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 29 LIMIT 1
---
  def edit
    @blog = Blog.find(params[:id])

SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 29 LIMIT 1
UPDATE `blogs` SET `text` = '編集画面の実装に成功しました！', `user_id` = NULL, `updated_at` = '2018-11-01 01:53:13' WHERE `blogs`.`id` = 29
---
  def update
    blog = Blog.find(params[:id])
    if blog.user_id == current_user.id
      blog.update(blog_params)